notes/talks/new_year_raku/E1-math_on_arbitrary_parallel_structures_in_perl5.org
* but can you math on *arbitrary* parallel datastructures?
** do recursive descent of two structures, creating a third as you go
*** perlish structures have *two* main types of aggregates: array and hashes
*** handling "holes" in one side requires looking at the other to get type
** perl solution
*** Data::Math, a module on cpan/github
**** cpan
***** https://metacpan.org/pod/Data::Math
***** https://metacpan.org/pod/Scalar::Classify
**** github
***** https://github.com/doomvox/data-math
***** https://github.com/doomvox/scalar-classify
