notes/talks/new_year_raku/E1-math_on_arbitrary_parallel_structures_in_perl5.md
- [but can you math on **arbitrary** parallel datastructures?](#org8c8f47e)
  - [do recursive descent of two structures, creating a third as you go](#orge822445)
    - [perlish structures have **two** main types of aggregates: array and hashes](#org0bb0b20)
    - [handling "holes" in one side requires looking at the other to get type](#org5f7bf0d)
  - [perl solution](#org3b62029)
    - [Data::Math, a module on cpan/github](#org28cf203)


<a id="org8c8f47e"></a>

# but can you math on **arbitrary** parallel datastructures?


<a id="orge822445"></a>

## do recursive descent of two structures, creating a third as you go


<a id="org0bb0b20"></a>

### perlish structures have **two** main types of aggregates: array and hashes


<a id="org5f7bf0d"></a>

### handling "holes" in one side requires looking at the other to get type


<a id="org3b62029"></a>

## perl solution


<a id="org28cf203"></a>

### Data::Math, a module on cpan/github

1.  cpan

    1.  <https://metacpan.org/pod/Data::Math>
    
    2.  <https://metacpan.org/pod/Scalar::Classify>

2.  github

    1.  <https://github.com/doomvox/data-math>
    
    2.  <https://github.com/doomvox/scalar-classify>
